myrottenpotatoes/app/controllers/movies_controller.rb

  def index
    @movies = Movie.order(sort_column + " " + sort_direction)
---
SELECT "movies".* FROM "movies" ORDER BY release_date desc